const data = [
{
    'uid': '1776448504',
    'name': '蔡徐坤',
    'gender': 'm',
    'lift': 'normal',
    'detail': [19.2, 19.7, 18.4, 20, 9.5]
},
{
    'uid': '1594052081',
    'name': '朱一龙',
    'gender': 'm',
    'lift': 'normal',
    'detail': [19.3, 19.6, 18.9, 17.3, 8.8]
},
{
    'uid': '5813256522',
    'name': '火箭少女101_孟美岐',
    'gender': 'f',
    'lift': 'up',
    'detail': [18.1, 17.6, 18.1, 15.6, 9.1]
},
{
    'uid': '3623353053',
    'name': 'TFBOYS-易烊千玺',
    'gender': 'm',
    'lift': 'down',
    'detail': [20, 18.7, 18.8, 10.6, 8.4]
},
{
    'uid': '2081681517',
    'name': '白宇WHITE',
    'gender': 'm',
    'lift': 'down',
    'detail': [17.1, 17.2, 16.6, 16.2, 8.7]
},
{
    'uid': '1220926753',
    'name': '吴昕',
    'gender': 'f',
    'lift': 'up',
    'detail': [18.8, 19.6, 20, 7.7, 8.4]
},
{
    'uid': '5456865382',
    'name': 'MD_摩登兄弟',
    'gender': 'm',
    'lift': 'up',
    'detail': [17.0, 18.2, 17.0, 14.5, 6.7]
},
{
    'uid': '1916655407',
    'name': '周冬雨',
    'gender': 'f',
    'lift': 'up',
    'detail': [18.1, 16.1, 17.5, 14.9, 6.2]
},
{
    'uid': '5541182601',
    'name': '火箭少女101_赖美云',
    'gender': 'f',
    'lift': 'up',
    'detail': [18.5, 15.2, 16.3, 13.2, 9.3]
},
{
    'uid': '2812335943',
    'name': 'TFBOYS-王源',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.9, 17.5, 19.3, 9.6, 8.5]
},
{
    'uid': '1860563805',
    'name': '罗云熙Leo',
    'gender': 'm',
    'lift': 'up',
    'detail': [15.9, 13.5, 16.4, 17.6, 8.4]
},
{
    'uid': '5350509769',
    'name': '范丞丞Adam0616',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.8, 17.7, 16.9, 11.7, 8.4]
},
{
    'uid': '1831550987',
    'name': '侯明昊Neo',
    'gender': 'm',
    'lift': 'up',
    'detail': [17.2, 17.8, 16.0, 13.8, 6.7]
},
{
    'uid': '1087770692',
    'name': '陈坤',
    'gender': 'm',
    'lift': 'up',
    'detail': [18.1, 17.6, 17.6, 10.1, 8.0]
},
{
    'uid': '1865901305',
    'name': '邓伦',
    'gender': 'm',
    'lift': 'up',
    'detail': [15.6, 14.8, 17.5, 14.5, 8.3]
},
{
    'uid': '2142058927',
    'name': '吴磊LEO',
    'gender': 'm',
    'lift': 'up',
    'detail': [18.2, 13.4, 17.5, 11.7, 9.9]
},
{
    'uid': '5796662600',
    'name': '火箭少女101_吴宣仪',
    'gender': 'f',
    'lift': 'up',
    'detail': [18.1, 16.4, 17.0, 11.0, 8.3]
},
{
    'uid': '1815418641',
    'name': '杨洋',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.1, 16.3, 17.7, 12.7, 7.8]
},
{
    'uid': '1642351362',
    'name': 'angelababy',
    'gender': 'f',
    'lift': 'up',
    'detail': [18.0, 17.0, 16.7, 11.1, 7.7]
},
{
    'uid': '1644250693',
    'name': '冯绍峰',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.9, 15.4, 18.3, 11.2, 8.6]
},
{
    'uid': '1227368500',
    'name': '杨紫',
    'gender': 'f',
    'lift': 'up',
    'detail': [17.8, 16.6, 18.4, 9.7, 7.8]
},
{
    'uid': '2609400635',
    'name': 'TFBOYS-王俊凯',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.4, 17.4, 18.4, 9.2, 8.6]
},
{
    'uid': '5644764907',
    'name': '火箭少女101_杨超越',
    'gender': 'f',
    'lift': 'down',
    'detail': [17.6, 17.6, 18.0, 10.4, 5.9]
},
{
    'uid': '1537790411',
    'name': 'M鹿M',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.5, 16.9, 17.6, 9.8, 8.3]
},
{
    'uid': '5615627418',
    'name': 'jjjustin0219',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.8, 18.3, 17.6, 9.8, 6.3]
},
{
    'uid': '1219847813',
    'name': '罗晋',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.2, 16.1, 16.8, 11.6, 7.4]
},
{
    'uid': '1241148864',
    'name': '张杰',
    'gender': 'm',
    'lift': 'up',
    'detail': [17.9, 18.3, 18.3, 7.0, 6.2]
},
{
    'uid': '5331040243',
    'name': '沈月',
    'gender': 'f',
    'lift': 'down',
    'detail': [16.0, 14.5, 15.9, 12.9, 8.1]
},
{
    'uid': '1259110474',
    'name': '赵丽颖',
    'gender': 'f',
    'lift': 'up',
    'detail': [16.3, 15.8, 18.5, 8.3, 8.6]
},
{
    'uid': '1792951112',
    'name': 'X玖少年团肖战DAYTOY',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.2, 17.0, 17.2, 9.0, 7.6]
},
{
    'uid': '5492443184',
    'name': 'UNIQ-王一博',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.6, 15.4, 17.5, 10.5, 7.0]
},
{
    'uid': '3228634923',
    'name': '胡一天啊',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.4, 16.0, 15.2, 11.5, 8.0]
},
{
    'uid': '1246130430',
    'name': '魏大勋',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.4, 15.9, 16.2, 12.3, 6.0]
},
{
    'uid': '1195242865',
    'name': '杨幂',
    'gender': 'f',
    'lift': 'down',
    'detail': [16.5, 15.7, 17.8, 8.3, 8.5]
},
{
    'uid': '2447034645',
    'name': 'THEO-朱正廷',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.0, 17.0, 17.3, 9.1, 7.1]
},
{
    'uid': '1989519725',
    'name': 'Johnny黄景瑜',
    'gender': 'm',
    'lift': 'up',
    'detail': [17.2, 17.7, 16.8, 7.5, 7.2]
},
{
    'uid': '1195813710',
    'name': '潘粤明',
    'gender': 'm',
    'lift': 'normal',
    'detail': [17.4, 16.4, 16.8, 9.3, 6.2]
},
{
    'uid': '2706896955',
    'name': '努力努力再努力x',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.2, 16.3, 17.9, 8.4, 7.3]
},
{
    'uid': '1239246050',
    'name': '薛之谦',
    'gender': 'm',
    'lift': 'down',
    'detail': [15.7, 15.6, 16.2, 10.6, 7.6]
},
{
    'uid': '1797270765',
    'name': '许魏洲ZZ',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.1, 15.6, 16.3, 10.1, 7.7]
},
{
    'uid': '1669879400',
    'name': 'Dear-迪丽热巴',
    'gender': 'f',
    'lift': 'down',
    'detail': [16.3, 16.3, 17.9, 7.0, 8.4]
},
{
    'uid': '1751675285',
    'name': '岳云鹏',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.9, 15.1, 16.5, 11.1, 6.2]
},
{
    'uid': '1192329374',
    'name': '谢娜',
    'gender': 'f',
    'lift': 'up',
    'detail': [18.8, 20, 19.6, 0, 7.2]
},
{
    'uid': '1533789260',
    'name': '陈学冬',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.4, 16.4, 17.2, 7.2, 8.2]
},
{
    'uid': '2034565060',
    'name': '许晴随行笔记',
    'gender': 'f',
    'lift': 'down',
    'detail': [15.5, 11.0, 14.8, 11.9, 12.3]
},
{
    'uid': '1763582395',
    'name': '韩庚',
    'gender': 'm',
    'lift': 'up',
    'detail': [15.8, 14.8, 15.9, 11.6, 7.2]
},
{
    'uid': '1195230310',
    'name': '何炅',
    'gender': 'm',
    'lift': 'up',
    'detail': [18.5, 19.2, 18.5, 1.4, 7.6]
},
{
    'uid': '1291477752',
    'name': '李易峰',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.7, 17.4, 18.4, 5.8, 6.9]
},
{
    'uid': '1192329893',
    'name': '秦岚',
    'gender': 'f',
    'lift': 'down',
    'detail': [16.0, 13.3, 18.1, 9.1, 8.7]
},
{
    'uid': '1259193624',
    'name': '李晨',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.5, 14.8, 17.0, 0, 16.5]
},
{
    'uid': '2713968254',
    'name': '崇利明要出现了',
    'gender': 'm',
    'lift': 'down',
    'detail': [17.0, 13.8, 17.1, 10.9, 6.0]
},
{
    'uid': '2419023797',
    'name': '张超Juck',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.7, 15.5, 15.6, 8.2, 8.5]
},
{
    'uid': '3669102477',
    'name': '鞠婧祎',
    'gender': 'f',
    'lift': 'up',
    'detail': [15.7, 15.0, 18.2, 7.7, 7.6]
},
{
    'uid': '5912106762',
    'name': '小鬼-王琳凯',
    'gender': 'm',
    'lift': 'up',
    'detail': [14.7, 13.9, 16.0, 12.6, 7.0]
},
{
    'uid': '1230663070',
    'name': '唐嫣',
    'gender': 'f',
    'lift': 'up',
    'detail': [15.8, 17.1, 16.4, 7.0, 7.7]
},
{
    'uid': '1274327470',
    'name': '徐海乔',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.3, 18.1, 19.0, 1.4, 8.7]
},
{
    'uid': '1276109774',
    'name': '于朦胧',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.4, 11.1, 16.4, 11.3, 8.2]
},
{
    'uid': '1573486971',
    'name': '茅子俊',
    'gender': 'm',
    'lift': 'down',
    'detail': [17.0, 14.2, 15.7, 6.5, 10]
},
{
    'uid': '1778742953',
    'name': '张靓颖',
    'gender': 'f',
    'lift': 'up',
    'detail': [17.2, 15.8, 18.7, 2.9, 8.6]
},
{
    'uid': '1192336151',
    'name': '何晟铭',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.2, 13.5, 12.8, 11.8, 8.9]
},
{
    'uid': '1319911982',
    'name': '张雪迎Sophie',
    'gender': 'f',
    'lift': 'up',
    'detail': [16.7, 16.0, 14.3, 8.8, 7.5]
},
{
    'uid': '1223178222',
    'name': '胡歌',
    'gender': 'm',
    'lift': 'down',
    'detail': [14.4, 13.9, 16.6, 12.4, 5.6]
},
{
    'uid': '1627500245',
    'name': '张彬彬Vin',
    'gender': 'm',
    'lift': 'down',
    'detail': [15.1, 14.2, 15.8, 10.3, 7.3]
},
{
    'uid': '3261134763',
    'name': '刘亦菲',
    'gender': 'f',
    'lift': 'up',
    'detail': [17.2, 15.8, 16.6, 5.5, 7.2]
},
{
    'uid': '1656809190',
    'name': '赵薇',
    'gender': 'f',
    'lift': 'up',
    'detail': [17.1, 15.0, 16.5, 3.7, 9.6]
},
{
    'uid': '2731728324',
    'name': '王鹤棣_Dylan',
    'gender': 'm',
    'lift': 'down',
    'detail': [14.7, 14.5, 14.4, 11.5, 6.7]
},
{
    'uid': '1504326643',
    'name': '经超经超',
    'gender': 'm',
    'lift': 'up',
    'detail': [15.7, 11.4, 16.7, 9.6, 8.3]
},
{
    'uid': '1320135280',
    'name': '袁姗姗',
    'gender': 'f',
    'lift': 'down',
    'detail': [17.2, 15.5, 17.7, 2.9, 8.3]
},
{
    'uid': '5542384916',
    'name': '火箭少女101_段奥娟',
    'gender': 'f',
    'lift': 'up',
    'detail': [17.2, 15.3, 14.5, 8.6, 5.7]
},
{
    'uid': '1234692083',
    'name': '馬天宇',
    'gender': 'm',
    'lift': 'down',
    'detail': [15.5, 16.6, 14.6, 7.9, 6.6]
},
{
    'uid': '5957839152',
    'name': '火箭少女101_Yamy',
    'gender': 'f',
    'lift': 'up',
    'detail': [16.6, 13.9, 15.4, 8.9, 6.3]
},
{
    'uid': '1271329254',
    'name': '黄轩的微博',
    'gender': 'm',
    'lift': 'down',
    'detail': [15.9, 12.9, 14.4, 10.9, 7.0]
},
{
    'uid': '1220924217',
    'name': '杜海涛',
    'gender': 'm',
    'lift': 'up',
    'detail': [17.9, 17.8, 18.1, 0, 6.9]
},
{
    'uid': '2902408801',
    'name': '宋茜',
    'gender': 'f',
    'lift': 'down',
    'detail': [16.2, 14.2, 16.3, 6.5, 7.4]
},
{
    'uid': '1827234850',
    'name': '秦俊杰',
    'gender': 'm',
    'lift': 'up',
    'detail': [14.1, 16.2, 14.5, 8.5, 7.2]
},
{
    'uid': '1574684061',
    'name': '陈赫',
    'gender': 'm',
    'lift': 'up',
    'detail': [17.3, 16.2, 16.0, 3.7, 7.4]
},
{
    'uid': '1275280670',
    'name': '郑恺',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.4, 14.9, 15.3, 7.4, 6.5]
},
{
    'uid': '3591355593',
    'name': 'Mr_凡先生',
    'gender': 'm',
    'lift': 'down',
    'detail': [16.2, 14.3, 17.8, 6.5, 5.5]
},
{
    'uid': '2112496475',
    'name': '白敬亭',
    'gender': 'm',
    'lift': 'down',
    'detail': [14.4, 14.3, 16.8, 7.4, 7.3]
},
{
    'uid': '1343887012',
    'name': '翟天临',
    'gender': 'm',
    'lift': 'up',
    'detail': [15.0, 14.1, 15.2, 8.9, 6.7]
},
{
    'uid': '1197191492',
    'name': '刘涛tamia',
    'gender': 'f',
    'lift': 'down',
    'detail': [15.4, 13.6, 16.6, 6.6, 7.7]
},
{
    'uid': '1517934944',
    'name': '张翰',
    'gender': 'm',
    'lift': 'down',
    'detail': [13.5, 12.0, 17.2, 10.7, 6.5]
},
{
    'uid': '1506711913',
    'name': '尹正',
    'gender': 'm',
    'lift': 'down',
    'detail': [15.1, 15.0, 15.6, 8.3, 5.9]
},
{
    'uid': '1965715555',
    'name': '深情的高伟光',
    'gender': 'm',
    'lift': 'up',
    'detail': [15.1, 14.0, 17.2, 5.8, 7.6]
},
{
    'uid': '5473085545',
    'name': '火箭少女101_傅菁',
    'gender': 'f',
    'lift': 'down',
    'detail': [15.9, 12.4, 15.6, 8.1, 7.7]
},
{
    'uid': '3800468188',
    'name': '任嘉伦Allen',
    'gender': 'm',
    'lift': 'up',
    'detail': [14.5, 12.3, 15.4, 10.5, 7.0]
},
{
    'uid': '2870450862',
    'name': '刘昊然turbo',
    'gender': 'm',
    'lift': 'up',
    'detail': [14.4, 13.3, 17.1, 6.5, 8.2]
},
{
    'uid': '1291843462',
    'name': '魏晨',
    'gender': 'm',
    'lift': 'up',
    'detail': [16.8, 15.6, 15.0, 4.3, 7.3]
},
{
    'uid': '2335410541',
    'name': '火箭少女101_紫宁',
    'gender': 'f',
    'lift': 'up',
    'detail': [15.0, 15.4, 14.6, 8.9, 5.0]
},
{
    'uid': '1821257283',
    'name': '黄圣依',
    'gender': 'f',
    'lift': 'up',
    'detail': [14.6, 12.0, 13.3, 0, 18.7]
},
{
    'uid': '1720140681',
    'name': '郭麒麟',
    'gender': 'm',
    'lift': 'up',
    'detail': [15.9, 16.4, 15.8, 2.9, 7.6]
},
{
    'uid': '1809054937',
    'name': '李沁',
    'gender': 'f',
    'lift': 'up',
    'detail': [16.7, 16.4, 17.6, 0, 7.8]
},
{
    'uid': '1288739185',
    'name': '关晓彤',
    'gender': 'f',
    'lift': 'down',
    'detail': [16.7, 16.1, 17.8, 0, 7.8]
},
{
    'uid': '1261700994',
    'name': '戚薇',
    'gender': 'f',
    'lift': 'down',
    'detail': [17.1, 16.6, 16.6, 0, 8.0]
},
{
    'uid': '1214435497',
    'name': '贾乃亮',
    'gender': 'm',
    'lift': 'up',
    'detail': [17.5, 17.1, 14.5, 0, 9.0]
},
{
    'uid': '1270344441',
    'name': '景甜',
    'gender': 'f',
    'lift': 'up',
    'detail': [15.7, 14.4, 16.6, 4.3, 7.0]
},
{
    'uid': '1197755162',
    'name': '韩雪',
    'gender': 'f',
    'lift': 'down',
    'detail': [16.4, 15.4, 16.9, 0, 9.3]
},
{
    'uid': '1624923463',
    'name': '华晨宇yu',
    'gender': 'm',
    'lift': 'down',
    'detail': [13.3, 12.6, 17.2, 14.8, 0]
},
{
    'uid': '1239315002',
    'name': '张嘉倪',
    'gender': 'f',
    'lift': 'up',
    'detail': [16.8, 15.7, 17.1, 0, 8.2]
}]